# RebarSystemOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..RebarSystemOffset Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
Rebar Cover Side/Edge is too large for sketch. Bar placement may be inaccurate.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarSystemOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemOffset As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarSystemOffset {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace